################################################################################
# Warning: this is an internal database file and is not intended for other usage
################################################################################
################################################################################
#
# Created by icc2 (Q-2019.12-SP4) internalDesignWriter on Fri May 19 13:17:22 2023
#
################################################################################

################################################################################
#
# Units
# time_unit               : 1e-09
# resistance_unit         : 1000000
# capacitive_load_unit    : 1e-15
# voltage_unit            : 1
# current_unit            : 1e-06
# power_unit              : 1e-12
################################################################################

# Implemented: supplies

set_design_attributes -elements . -internal_attribute _mv_data_file_version 1
set_design_attributes -elements {.} -attribute lower_domain_boundary false
create_power_domain PD_ORCA_TOP -include_scope
create_power_domain PD_RISC_CORE -elements I_RISC_CORE
create_supply_net -domain PD_ORCA_TOP VSS
create_supply_net -domain PD_ORCA_TOP VDD
create_supply_net -domain PD_ORCA_TOP VDDH
set_domain_supply_net PD_ORCA_TOP -primary_power_net VDD -primary_ground_net VSS
create_supply_port VDD -domain PD_ORCA_TOP -direction in
create_supply_port VSS -domain PD_ORCA_TOP -direction in
create_supply_port VDDH -domain PD_ORCA_TOP -direction in
connect_supply_net VSS -ports {VSS}
connect_supply_net VDD -ports {VDD}
connect_supply_net VDDH -ports {VDDH}
create_supply_net -domain PD_RISC_CORE VSS -reuse
create_supply_net -domain PD_RISC_CORE VDD -reuse
create_supply_net -domain PD_RISC_CORE VDDH -reuse
set_domain_supply_net PD_RISC_CORE -primary_power_net VDDH -primary_ground_net VSS
set_level_shifter ls_in -domain PD_RISC_CORE -applies_to inputs -rule low_to_high -location self
set_level_shifter ls_out -domain PD_RISC_CORE -applies_to outputs -rule high_to_low -location parent
add_port_state VSS -state {always 0.000000}
add_port_state VDD -state {V0p75 0.750000}
add_port_state VDDH -state {V0p75 0.750000}
add_port_state VDDH -state {V0p95 0.950000}
add_port_state VDD -state {V0p95 0.950000}
add_port_state VDDH -state {V1p16 1.160000}
create_pst power_state -supplies {VDD VDDH VSS}
add_pst_state risc_high_worst -pst power_state -state {V0p75 V0p95 always}
add_pst_state risc_low_worst -pst power_state -state {V0p75 V0p75 always}
add_pst_state risc_high_best -pst power_state -state {V0p95 V1p16 always}
add_pst_state risc_low_best -pst power_state -state {V0p95 V0p95 always}

## Constraints below are generated by snps. Please do not modify.
set derived_upf true

if ($derived_upf) {

connect_supply_net VSS -ports {Xecutng_Instrn_0__UPF_LS/VSS \
    Xecutng_Instrn_1__UPF_LS/VSS Xecutng_Instrn_2__UPF_LS/VSS \
    Xecutng_Instrn_3__UPF_LS/VSS Xecutng_Instrn_4__UPF_LS/VSS \
    Xecutng_Instrn_5__UPF_LS/VSS Xecutng_Instrn_6__UPF_LS/VSS \
    Xecutng_Instrn_7__UPF_LS/VSS Xecutng_Instrn_8__UPF_LS/VSS \
    Xecutng_Instrn_9__UPF_LS/VSS Xecutng_Instrn_10__UPF_LS/VSS \
    Xecutng_Instrn_11__UPF_LS/VSS Xecutng_Instrn_12__UPF_LS/VSS \
    Xecutng_Instrn_14__UPF_LS/VSS Xecutng_Instrn_15__UPF_LS/VSS \
    Xecutng_Instrn_16__UPF_LS/VSS Xecutng_Instrn_17__UPF_LS/VSS \
    Xecutng_Instrn_18__UPF_LS/VSS Xecutng_Instrn_19__UPF_LS/VSS \
    Xecutng_Instrn_20__UPF_LS/VSS Xecutng_Instrn_21__UPF_LS/VSS \
    Xecutng_Instrn_22__UPF_LS/VSS Xecutng_Instrn_23__UPF_LS/VSS \
    Xecutng_Instrn_24__UPF_LS/VSS Xecutng_Instrn_25__UPF_LS/VSS \
    Xecutng_Instrn_26__UPF_LS/VSS Xecutng_Instrn_27__UPF_LS/VSS \
    Xecutng_Instrn_28__UPF_LS/VSS Xecutng_Instrn_30__UPF_LS/VSS \
    Xecutng_Instrn_31__UPF_LS/VSS PSW_2__UPF_LS/VSS PSW_3__UPF_LS/VSS \
    PSW_4__UPF_LS/VSS PSW_6__UPF_LS/VSS PSW_8__UPF_LS/VSS PSW_9__UPF_LS/VSS \
    PSW_10__UPF_LS/VSS RESULT_DATA_0__UPF_LS/VSS RESULT_DATA_1__UPF_LS/VSS \
    RESULT_DATA_2__UPF_LS/VSS RESULT_DATA_3__UPF_LS/VSS \
    RESULT_DATA_4__UPF_LS/VSS RESULT_DATA_5__UPF_LS/VSS \
    RESULT_DATA_6__UPF_LS/VSS RESULT_DATA_7__UPF_LS/VSS \
    RESULT_DATA_8__UPF_LS/VSS RESULT_DATA_9__UPF_LS/VSS \
    RESULT_DATA_10__UPF_LS/VSS RESULT_DATA_11__UPF_LS/VSS \
    RESULT_DATA_12__UPF_LS/VSS RESULT_DATA_13__UPF_LS/VSS \
    RESULT_DATA_14__UPF_LS/VSS RESULT_DATA_15__UPF_LS/VSS \
    EndOfInstrn_UPF_LS/VSS OUT_VALID_UPF_LS/VSS PSW_7__UPF_LS/VSS \
    Xecutng_Instrn_13__UPF_LS/VSS I_RISC_CORE/Instrn_27__UPF_LS/VSS \
    I_RISC_CORE/Instrn_28__UPF_LS/VSS I_RISC_CORE/Instrn_26__UPF_LS/VSS \
    I_RISC_CORE/Instrn_31__UPF_LS/VSS I_RISC_CORE/Instrn_24__UPF_LS/VSS \
    I_RISC_CORE/Instrn_4__UPF_LS/VSS I_RISC_CORE/Instrn_5__UPF_LS/VSS \
    I_RISC_CORE/Instrn_17__UPF_LS/VSS I_RISC_CORE/Instrn_16__UPF_LS/VSS \
    I_RISC_CORE/Instrn_18__UPF_LS/VSS I_RISC_CORE/Instrn_20__UPF_LS/VSS \
    I_RISC_CORE/Instrn_29__UPF_LS/VSS I_RISC_CORE/Instrn_13__UPF_LS/VSS \
    I_RISC_CORE/Instrn_12__UPF_LS/VSS I_RISC_CORE/Instrn_21__UPF_LS/VSS \
    I_RISC_CORE/Instrn_8__UPF_LS/VSS I_RISC_CORE/Instrn_9__UPF_LS/VSS \
    I_RISC_CORE/Instrn_14__UPF_LS/VSS I_RISC_CORE/Instrn_11__UPF_LS/VSS \
    I_RISC_CORE/Instrn_10__UPF_LS/VSS I_RISC_CORE/Instrn_15__UPF_LS/VSS \
    I_RISC_CORE/Instrn_23__UPF_LS/VSS I_RISC_CORE/Instrn_22__UPF_LS/VSS \
    I_RISC_CORE/reset_n_UPF_LS/VSS I_RISC_CORE/Instrn_30__UPF_LS/VSS \
    I_RISC_CORE/Instrn_7__UPF_LS/VSS I_RISC_CORE/Instrn_0__UPF_LS/VSS \
    I_RISC_CORE/Instrn_2__UPF_LS/VSS I_RISC_CORE/Instrn_3__UPF_LS/VSS \
    I_RISC_CORE/Instrn_1__UPF_LS/VSS I_RISC_CORE/test_si1_UPF_LS/VSS \
    I_RISC_CORE/scan_enable_UPF_LS/VSS Xecutng_Instrn_29__UPF_LS/VSS \
    STACK_FULL_UPF_LS/VSS Rd_Instr_UPF_LS/VSS PSW_5__UPF_LS/VSS \
    I_RISC_CORE/Instrn_6__UPF_LS/VSS I_RISC_CORE/Instrn_25__UPF_LS/VSS \
    I_RISC_CORE/Instrn_19__UPF_LS/VSS}
connect_supply_net VDD -ports {Xecutng_Instrn_0__UPF_LS/VDDL \
    Xecutng_Instrn_1__UPF_LS/VDDL Xecutng_Instrn_2__UPF_LS/VDDL \
    Xecutng_Instrn_3__UPF_LS/VDDL Xecutng_Instrn_4__UPF_LS/VDDL \
    Xecutng_Instrn_5__UPF_LS/VDDL Xecutng_Instrn_6__UPF_LS/VDDL \
    Xecutng_Instrn_7__UPF_LS/VDDL Xecutng_Instrn_8__UPF_LS/VDDL \
    Xecutng_Instrn_9__UPF_LS/VDDL Xecutng_Instrn_10__UPF_LS/VDDL \
    Xecutng_Instrn_11__UPF_LS/VDDL Xecutng_Instrn_12__UPF_LS/VDDL \
    Xecutng_Instrn_14__UPF_LS/VDDL Xecutng_Instrn_15__UPF_LS/VDDL \
    Xecutng_Instrn_16__UPF_LS/VDDL Xecutng_Instrn_17__UPF_LS/VDDL \
    Xecutng_Instrn_18__UPF_LS/VDDL Xecutng_Instrn_19__UPF_LS/VDDL \
    Xecutng_Instrn_20__UPF_LS/VDDL Xecutng_Instrn_21__UPF_LS/VDDL \
    Xecutng_Instrn_22__UPF_LS/VDDL Xecutng_Instrn_23__UPF_LS/VDDL \
    Xecutng_Instrn_24__UPF_LS/VDDL Xecutng_Instrn_25__UPF_LS/VDDL \
    Xecutng_Instrn_26__UPF_LS/VDDL Xecutng_Instrn_27__UPF_LS/VDDL \
    Xecutng_Instrn_28__UPF_LS/VDDL Xecutng_Instrn_30__UPF_LS/VDDL \
    Xecutng_Instrn_31__UPF_LS/VDDL PSW_2__UPF_LS/VDDL PSW_3__UPF_LS/VDDL \
    PSW_4__UPF_LS/VDDL PSW_6__UPF_LS/VDDL PSW_8__UPF_LS/VDDL PSW_9__UPF_LS/VDDL \
    PSW_10__UPF_LS/VDDL RESULT_DATA_0__UPF_LS/VDDL RESULT_DATA_1__UPF_LS/VDDL \
    RESULT_DATA_2__UPF_LS/VDDL RESULT_DATA_3__UPF_LS/VDDL \
    RESULT_DATA_4__UPF_LS/VDDL RESULT_DATA_5__UPF_LS/VDDL \
    RESULT_DATA_6__UPF_LS/VDDL RESULT_DATA_7__UPF_LS/VDDL \
    RESULT_DATA_8__UPF_LS/VDDL RESULT_DATA_9__UPF_LS/VDDL \
    RESULT_DATA_10__UPF_LS/VDDL RESULT_DATA_11__UPF_LS/VDDL \
    RESULT_DATA_12__UPF_LS/VDDL RESULT_DATA_13__UPF_LS/VDDL \
    RESULT_DATA_14__UPF_LS/VDDL RESULT_DATA_15__UPF_LS/VDDL \
    EndOfInstrn_UPF_LS/VDDL OUT_VALID_UPF_LS/VDDL PSW_7__UPF_LS/VDDL \
    Xecutng_Instrn_13__UPF_LS/VDDL I_RISC_CORE/Instrn_27__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_28__UPF_LS/VDDL I_RISC_CORE/Instrn_26__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_31__UPF_LS/VDDL I_RISC_CORE/Instrn_24__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_4__UPF_LS/VDDL I_RISC_CORE/Instrn_5__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_17__UPF_LS/VDDL I_RISC_CORE/Instrn_16__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_18__UPF_LS/VDDL I_RISC_CORE/Instrn_20__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_29__UPF_LS/VDDL I_RISC_CORE/Instrn_13__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_12__UPF_LS/VDDL I_RISC_CORE/Instrn_21__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_8__UPF_LS/VDDL I_RISC_CORE/Instrn_9__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_14__UPF_LS/VDDL I_RISC_CORE/Instrn_11__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_10__UPF_LS/VDDL I_RISC_CORE/Instrn_15__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_23__UPF_LS/VDDL I_RISC_CORE/Instrn_22__UPF_LS/VDDL \
    I_RISC_CORE/reset_n_UPF_LS/VDDL I_RISC_CORE/Instrn_30__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_7__UPF_LS/VDDL I_RISC_CORE/Instrn_0__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_2__UPF_LS/VDDL I_RISC_CORE/Instrn_3__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_1__UPF_LS/VDDL I_RISC_CORE/test_si1_UPF_LS/VDDL \
    I_RISC_CORE/scan_enable_UPF_LS/VDDL Xecutng_Instrn_29__UPF_LS/VDDL \
    STACK_FULL_UPF_LS/VDDL Rd_Instr_UPF_LS/VDDL PSW_5__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_6__UPF_LS/VDDL I_RISC_CORE/Instrn_25__UPF_LS/VDDL \
    I_RISC_CORE/Instrn_19__UPF_LS/VDDL}
connect_supply_net VDDH -ports {I_RISC_CORE/Instrn_27__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_28__UPF_LS/VDDH I_RISC_CORE/Instrn_26__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_31__UPF_LS/VDDH I_RISC_CORE/Instrn_24__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_4__UPF_LS/VDDH I_RISC_CORE/Instrn_5__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_17__UPF_LS/VDDH I_RISC_CORE/Instrn_16__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_18__UPF_LS/VDDH I_RISC_CORE/Instrn_20__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_29__UPF_LS/VDDH I_RISC_CORE/Instrn_13__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_12__UPF_LS/VDDH I_RISC_CORE/Instrn_21__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_8__UPF_LS/VDDH I_RISC_CORE/Instrn_9__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_14__UPF_LS/VDDH I_RISC_CORE/Instrn_11__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_10__UPF_LS/VDDH I_RISC_CORE/Instrn_15__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_23__UPF_LS/VDDH I_RISC_CORE/Instrn_22__UPF_LS/VDDH \
    I_RISC_CORE/reset_n_UPF_LS/VDDH I_RISC_CORE/Instrn_30__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_7__UPF_LS/VDDH I_RISC_CORE/Instrn_0__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_2__UPF_LS/VDDH I_RISC_CORE/Instrn_3__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_1__UPF_LS/VDDH I_RISC_CORE/test_si1_UPF_LS/VDDH \
    I_RISC_CORE/scan_enable_UPF_LS/VDDH I_RISC_CORE/Instrn_6__UPF_LS/VDDH \
    I_RISC_CORE/Instrn_25__UPF_LS/VDDH I_RISC_CORE/Instrn_19__UPF_LS/VDDH}

set_design_attributes -elements . -internal_attribute _mv_data_status ready
set_design_attributes -elements {I_RISC_CORE/Instrn_27__UPF_LS \
    I_RISC_CORE/Instrn_28__UPF_LS I_RISC_CORE/Instrn_26__UPF_LS \
    I_RISC_CORE/Instrn_31__UPF_LS I_RISC_CORE/Instrn_24__UPF_LS \
    I_RISC_CORE/Instrn_4__UPF_LS I_RISC_CORE/Instrn_5__UPF_LS \
    I_RISC_CORE/Instrn_17__UPF_LS I_RISC_CORE/Instrn_16__UPF_LS \
    I_RISC_CORE/Instrn_18__UPF_LS I_RISC_CORE/Instrn_20__UPF_LS \
    I_RISC_CORE/Instrn_29__UPF_LS I_RISC_CORE/Instrn_13__UPF_LS \
    I_RISC_CORE/Instrn_12__UPF_LS I_RISC_CORE/Instrn_21__UPF_LS \
    I_RISC_CORE/Instrn_8__UPF_LS I_RISC_CORE/Instrn_9__UPF_LS \
    I_RISC_CORE/Instrn_14__UPF_LS I_RISC_CORE/Instrn_11__UPF_LS \
    I_RISC_CORE/Instrn_10__UPF_LS I_RISC_CORE/Instrn_15__UPF_LS \
    I_RISC_CORE/Instrn_23__UPF_LS I_RISC_CORE/Instrn_22__UPF_LS \
    I_RISC_CORE/reset_n_UPF_LS I_RISC_CORE/Instrn_30__UPF_LS \
    I_RISC_CORE/Instrn_7__UPF_LS I_RISC_CORE/Instrn_0__UPF_LS \
    I_RISC_CORE/Instrn_2__UPF_LS I_RISC_CORE/Instrn_3__UPF_LS \
    I_RISC_CORE/Instrn_1__UPF_LS I_RISC_CORE/test_si1_UPF_LS \
    I_RISC_CORE/scan_enable_UPF_LS I_RISC_CORE/Instrn_6__UPF_LS \
    I_RISC_CORE/Instrn_25__UPF_LS I_RISC_CORE/Instrn_19__UPF_LS} \
    -internal_attribute _power_strategy_domain PD_RISC_CORE -internal_attribute \
    _power_strategy_name ls_in -internal_attribute _power_strategy_link_type \
    tool_derived
set_design_attributes -elements {Xecutng_Instrn_0__UPF_LS \
    Xecutng_Instrn_1__UPF_LS Xecutng_Instrn_2__UPF_LS Xecutng_Instrn_3__UPF_LS \
    Xecutng_Instrn_4__UPF_LS Xecutng_Instrn_5__UPF_LS Xecutng_Instrn_6__UPF_LS \
    Xecutng_Instrn_7__UPF_LS Xecutng_Instrn_8__UPF_LS Xecutng_Instrn_9__UPF_LS \
    Xecutng_Instrn_10__UPF_LS Xecutng_Instrn_11__UPF_LS \
    Xecutng_Instrn_12__UPF_LS Xecutng_Instrn_14__UPF_LS \
    Xecutng_Instrn_15__UPF_LS Xecutng_Instrn_16__UPF_LS \
    Xecutng_Instrn_17__UPF_LS Xecutng_Instrn_18__UPF_LS \
    Xecutng_Instrn_19__UPF_LS Xecutng_Instrn_20__UPF_LS \
    Xecutng_Instrn_21__UPF_LS Xecutng_Instrn_22__UPF_LS \
    Xecutng_Instrn_23__UPF_LS Xecutng_Instrn_24__UPF_LS \
    Xecutng_Instrn_25__UPF_LS Xecutng_Instrn_26__UPF_LS \
    Xecutng_Instrn_27__UPF_LS Xecutng_Instrn_28__UPF_LS \
    Xecutng_Instrn_30__UPF_LS Xecutng_Instrn_31__UPF_LS PSW_2__UPF_LS \
    PSW_3__UPF_LS PSW_4__UPF_LS PSW_6__UPF_LS PSW_8__UPF_LS PSW_9__UPF_LS \
    PSW_10__UPF_LS RESULT_DATA_0__UPF_LS RESULT_DATA_1__UPF_LS \
    RESULT_DATA_2__UPF_LS RESULT_DATA_3__UPF_LS RESULT_DATA_4__UPF_LS \
    RESULT_DATA_5__UPF_LS RESULT_DATA_6__UPF_LS RESULT_DATA_7__UPF_LS \
    RESULT_DATA_8__UPF_LS RESULT_DATA_9__UPF_LS RESULT_DATA_10__UPF_LS \
    RESULT_DATA_11__UPF_LS RESULT_DATA_12__UPF_LS RESULT_DATA_13__UPF_LS \
    RESULT_DATA_14__UPF_LS RESULT_DATA_15__UPF_LS EndOfInstrn_UPF_LS \
    OUT_VALID_UPF_LS PSW_7__UPF_LS Xecutng_Instrn_13__UPF_LS \
    Xecutng_Instrn_29__UPF_LS STACK_FULL_UPF_LS Rd_Instr_UPF_LS PSW_5__UPF_LS} \
    -internal_attribute _power_strategy_domain PD_RISC_CORE -internal_attribute \
    _power_strategy_name ls_out -internal_attribute _power_strategy_link_type \
    tool_derived
set_design_attributes -elements . -internal_attribute _ldi_supply_nets {VDD \
    VDDH VSS} -internal_attribute _ldi_domains {{PD_ORCA_TOP+VDD+VSS} \
    {PD_RISC_CORE+VDDH+VSS}}

}
set derived_upf false
